{
    "Ph1": "DE",
    "Ph2": "Frontend-Entwickler",
    "Ph3": "Erfahrung",
    "Ph4": "Zertifikate",
    "Ph5": "Projekte",
    "Ph6": "Seit Jahren bin ich mit IT als Hobby verbunden, und nach einigen Jahren als IT-Spezialist habe ich meine Rolle als Frontend-Entwickler übernommen, mit der klaren Absicht, meine Fähigkeiten in diesem Bereich weiter auszubauen. In Zukunft möchte ich auch in die Backend-Entwicklung eintauchen, um ein umfassendes Verständnis des Anwendungsentwicklungsprozesses und der Client-Server-Kommunikation zu gewinnen.",
    "Ph7": "Täglich arbeite ich an der Programmierung einer B2B-Plattform, verbessere bestehende Funktionen und setze neue um. Dabei stoße ich auf interessante Aufgaben – zum Beispiel habe ich eine Website für einen Hersteller aus der Photovoltaik-Branche entwickelt, einen Konfigurator für Modulhäuser erstellt und den Frontend-Teil eines Konfigurators für Photovoltaik-Ballastkonstruktionen mit einem Wind- und Schneelast-Rechner programmiert. Ich bin bereit für weitere spannende Herausforderungen – je anspruchsvoller, desto besser!",
    "Ph8": "Besonders interessieren mich Projekte mit React, Vue und Angular, da sie mir die Möglichkeit bieten, mein Wissen zu erweitern.",
    "Ph9": "Zukünftig plane ich auch, mich mit Backend-Entwicklung zu befassen, um ein umfassendes Verständnis des Anwendungsentwicklungsprozesses und der Client-Server-Kommunikation zu erlangen.",
    "Ph10": "Während meiner Karriere als Entwickler habe ich nicht nur neue Elemente für eine Verkaufsplattform programmiert, sondern auch einen Konfigurator für Modulhäuser, ein Ballastsystem für Solaranlagen und eine responsive Website für einen Großhändler und Distributor für Photovoltaik-Technologien erstellt.",
    "Ph11": "Entwicklung der B2B-Plattform: Fortgeschrittene Programmierung und Optimierung der B2B-Plattform (https://b2b.keno-energy.com) mit Fokus auf Leistung und Skalierbarkeit",
    "Ph12": "Implementierung fortschrittlicher Funktionen: Entwurf und Implementierung neuer, komplexer Funktionen innerhalb der Verkaufsplattform unter Beachtung der bestehenden Architektur",
    "Ph13": "Erstellung fortschrittlicher UI-Komponenten: Entwicklung und Bereitstellung moderner Website-Vorlagen und Komponenten unter Einhaltung der besten Praktiken in UX/UI und Barrierefreiheit",
    "Ph14": "Fortgeschrittene Datenverarbeitung: Integration und Verwaltung komplexer JSON-Datenoperationen, einschließlich Parsing, Validierung und Transformation",
    "Ph15": "Grafikverwaltung: Bearbeitung und Optimierung von 2D-Grafiken für Webzwecke",
    "Ph16": "Mid Frontend-Entwickler",
    "Ph17": "KENO Sp. z o.o.",
    "Ph18": "Junior Frontend-Entwickler",
    "Ph19": "https://www.keno-energy.com/",
    "Ph20": "Januar 2023",
    "Ph21": "Dezember 2023",
    "Ph22": "Programmierung der B2B-Plattform (https://b2b.keno-energy.com)",
    "Ph23": "Implementierung neuer Funktionen in die Verkaufsplattform",
    "Ph24": "Erstellung von Website-Vorlagen/Komponenten",
    "Ph25": "JSON/Daten-Parsing",
    "Ph26": "Bearbeitung von 2D-Grafiken für Website-Zwecke",
    "Ph27": "HTML",
    "Ph28": "JavaScript",
    "Ph29": "CSS",
    "Ph30": "Bootstrap",
    "Ph31": "Handlebars",
    "Ph32": "IT Service Desk Specialist/Helpdesk",
    "Ph33": "August 2022",
    "Ph34": "Dezember 2022",
    "Ph35": "IT-Beratung",
    "Ph36": "Erstlinien-Support für Mitarbeiter",
    "Ph37": "Fehler- und Störungsbehandlung",
    "Ph38": "Zusammenbau und Vorbereitung von Arbeitsplätzen, einschließlich der Installation der erforderlichen Software",
    "Ph39": "Verwaltung und Wartung von Computerhardware",
    "Ph40": "Bearbeitung von Bestellungen für Computerhardware",
    "Ph41": "Konfiguration und Wartung von Netzgeräten, Druckern, Terminals",
    "Ph42": "Analyse der Hardwarekosten",
    "Ph43": "Zugriffs- und Berechtigungsverwaltung",
    "Ph44": "Verwaltung von Softwarelizenzen",
    "Ph45": "Konfiguration von Mobilgeräten",
    "Ph46": "Unterstützung und Hilfe für die IT-Abteilung",
    "Ph47": "VPN",
    "Ph48": "Netzwerk",
    "Ph49": "Hardware",
    "Ph50": "Verwaltung",
    "Ph51": "Helpdesk",
    "Ph52": "Senior IT Specialist",
    "Ph53": "iPrime Management sp. z o.o.",
    "Ph54": "November 2021",
    "Ph55": "Juli 2022",
    "Ph56": "Linux-Server-Administration (SMB, VPN, Docker, VPS (AWS), VMware, Zabbix)",
    "Ph57": "Hardware- und Datensicherheit/Verschlüsselung",
    "Ph58": "Verwaltung der IT-Umgebung des Unternehmens",
    "Ph59": "Verwaltung von Domains und Subdomains",
    "Ph60": "Datenwiederherstellung",
    "Ph61": "Analyse der Instandhaltungskosten der Infrastruktur",
    "Ph62": "Erstellung von Vorlagen/Komponenten für React.js-Anwendungen (JavaScript/TypeScript)",
    "Ph63": "Python",
    "Ph64": "IT-Spezialist",
    "Ph65": "September 2020",
    "Ph66": "Oktober 2021",
    "Ph67": "IT-Beratung",
    "Ph68": "Erstellung kleiner Apps (Python) zur Arbeitsautomatisierung",
    "Ph69": "Konfiguration und Wartung des lokalen Netzwerks und der Netzwerkgeräte",
    "Ph70": "Zugriffs- und Berechtigungsverwaltung",
    "Ph71": "Konfiguration von Mobilgeräten",
    "Ph72": "Fehler- und Störungsbehandlung",
    "Ph73": "Verwaltung und Wartung von Computerhardware",
    "Ph74": "Zusammenbau und Vorbereitung von Arbeitsplätzen, einschließlich der Installation der erforderlichen Software",
    "Ph75": "Installation von Überwachungssystemen (IP-Kameras, Rekorder, Online-Ansicht)",
    "Ph76": "Erstellung von Website-Vorlagen auf Basis von HTML, SCSS, JS",
    "Ph77": "Januar 2024",
    "Ph78": "Gegenwärtig",
    "Ph79": "Eine Website, die mein Portfolio präsentiert, einschließlich einer Beschreibung meiner Karriere, erworbenen Zertifikaten und abgeschlossenen Projekten. Die Seite ist responsiv und intuitiv, mit Abschnitten, die meine Fähigkeiten, Erfahrungen und detaillierte Informationen zu den Projekten beschreiben, ergänzt durch Links zum Quellcode.",
    "Ph80": "Das Repository enthält ein browserbasiertes Spiel, das mit HTML, CSS und JavaScript entwickelt wurde und Bibliotheken wie jQuery, Bootstrap und Handlebars.js verwendet. Zu den Hauptfunktionen gehören ein dynamisches Steuerungssystem für den Spieler, das auf Tasteneingaben reagiert, Animationen verwaltet und physikalische Interaktionen wie Schwerkraft und Reibung berücksichtigt. Das Spiel bietet eine Vielzahl von Charakteraktionen wie Laufen, Springen, Ducken, Schützen und Power-Ups, was das Gameplay interaktiv und dynamisch gestaltet. Das System zur Aktualisierung der Benutzeroberfläche zeigt den aktuellen Gesundheits- und Kraftstatus des Spielers an.",
    "Ph81": "Ich bin Frontend-Entwickler mit mehrjähriger Erfahrung in der Gestaltung und Entwicklung moderner Webanwendungen. Meine Laufbahn in der IT begann als IT-Spezialist, was mir ein solides technisches Fundament und ein gutes Verständnis für den geschäftlichen Kontext von Projekten verschaffte.",
    "Ph82": "Meine ersten Schritte im Programmieren machte ich mit Python, doch JavaScript wurde schnell zu meiner Hauptspezialisierung. Seitdem verbessere ich konsequent meine Fähigkeiten und sammle Erfahrung in der Entwicklung effizienter, skalierbarer und benutzerfreundlicher Anwendungen.",
    "Ph83": "Täglich arbeite ich an der Weiterentwicklung einer B2B-Verkaufsplattform, bei der ich für Leistung, Funktionalität und Benutzerfreundlichkeit verantwortlich bin. Im Rahmen verschiedener Projekte hatte ich die Gelegenheit, eine Website für einen Hersteller aus der Photovoltaikbranche zu erstellen sowie Konfiguratoren für Modulhäuser, Ballastkonstruktionen, Carports und PV-Anlagen zu entwickeln.",
    "Ph84": "In meiner Arbeit lege ich großen Wert auf hohe Codequalität, durchdachte Benutzeroberflächen und Lösungen, die das Nutzererlebnis spürbar verbessern.",
    "Ph85": "Künstliche Intelligenz spielt in meiner täglichen Arbeit eine immer größere Rolle – sie unterstützt mich beim Design, Debugging und bei der Code-Optimierung sowie bei der Automatisierung wiederkehrender Aufgaben. Dadurch kann ich mich noch stärker auf die Schlüsselaspekte eines Projekts und die Bereitstellung moderner Lösungen konzentrieren.",
    "Ph86": "Derzeit bin ich offen für neue Herausforderungen und Möglichkeiten der Zusammenarbeit. Wenn Sie über ein Projekt sprechen oder einfach Erfahrungen austauschen möchten – kontaktieren Sie mich gerne!"
}
