{
    "Ph1": "EN",
    "Ph2": "Frontend Developer",
    "Ph3": "Experience",
    "Ph4": "Certificates",
    "Ph5": "Projects",
    "Ph6": "I've been passionate about IT for years, starting my professional journey as an IT specialist and now evolving as a frontend developer, with a strong intention to further enhance my skills in this field. In the future, I plan to dive into backend development to gain a comprehensive understanding of the application development process and client-server communication.",
    "Ph7": "On a daily basis, I work on programming a B2B platform, enhancing existing functionalities and implementing new ones. My work involves intriguing challenges – for instance, I developed a website for a photovoltaic industry manufacturer, created a configurator for modular homes, and wrote the frontend part of a configurator for photovoltaic ballast constructions, complete with a wind and snow load calculator. I’m ready for more exciting challenges – the more complex, the better!",
    "Ph8": "I am particularly interested in React, Vue, and Angular projects, as they would allow me to expand my expertise.",
    "Ph9": "In the future, I also plan to delve into backend development to gain a comprehensive understanding of the application development process and client-server communication.",
    "Ph10": "Throughout my career as a developer, I have not only programmed new elements for a sales platform but also created a modular house configurator, solar ballast system configurator, and a responsive website for a wholesaler and distributor of photovoltaic technologies.",
    "Ph11": "Development of B2B Platform: Advanced programming and optimization of the B2B platform (https://b2b.keno-energy.com) with a focus on performance and scalability",
    "Ph12": "Implementation of Advanced Features: Designing and implementing new, complex functionalities within the sales platform, ensuring consistency with the existing architecture",
    "Ph13": "Creation of Advanced UI Components: Developing and deploying modern website templates and components, adhering to best practices in UX/UI and accessibility",
    "Ph14": "Advanced Data Processing: Integrating and managing complex JSON data operations, including parsing, validation, and transformation",
    "Ph15": "Graphic Asset Management: Editing and optimizing 2D graphics for web purposes",
    "Ph16": "Mid Frontend Developer",
    "Ph17": "KENO Sp. z o.o.",
    "Ph18": "Junior Frontend Developer",
    "Ph19": "https://www.keno-energy.com/",
    "Ph20": "January 2023",
    "Ph21": "December 2023",
    "Ph22": "B2B platform programming (https://b2b.keno-energy.com)",
    "Ph23": "Implementing new functionalities into the sales platform",
    "Ph24": "Creating website templates/components",
    "Ph25": "JSON/data parsing",
    "Ph26": "Editing 2D graphics for website purposes",
    "Ph27": "HTML",
    "Ph28": "JavaScript",
    "Ph29": "CSS",
    "Ph30": "Bootstrap",
    "Ph31": "Handlebars",
    "Ph32": "IT Service Desk Specialist/Helpdesk",
    "Ph33": "August 2022",
    "Ph34": "December 2022",
    "Ph35": "IT consulting",
    "Ph36": "First line support for employees",
    "Ph37": "Error and crash handling",
    "Ph38": "Assembling and preparing workstations, including required software installation",
    "Ph39": "Computer hardware management and servicing",
    "Ph40": "Handling orders for computer equipment",
    "Ph41": "Configuration and maintenance of the network devices, printers, terminals",
    "Ph42": "Analysis of hardware costs",
    "Ph43": "Access and authorization management",
    "Ph44": "Software license management",
    "Ph45": "Configuring mobile devices",
    "Ph46": "Support and assistance to the IT department",
    "Ph47": "VPN",
    "Ph48": "Network",
    "Ph49": "Hardware",
    "Ph50": "Administration",
    "Ph51": "Helpdesk",
    "Ph52": "Senior IT Specialist",
    "Ph53": "iPrime Management sp. z o.o.",
    "Ph54": "November 2021",
    "Ph55": "July 2022",
    "Ph56": "Linux server administration (SMB, VPN, Docker, VPS (AWS), VMware, Zabbix)",
    "Ph57": "Hardware and data security/encryption",
    "Ph58": "Administration of the company's IT environment",
    "Ph59": "Domains and subdomains administration",
    "Ph60": "Data recovery",
    "Ph61": "Analysis of infrastructure maintenance costs",
    "Ph62": "Creating templates/components used in React.js applications (JavaScript/TypeScript)",
    "Ph63": "Python",
    "Ph64": "IT Specialist",
    "Ph65": "September 2020",
    "Ph66": "October 2021",
    "Ph67": "IT consulting",
    "Ph68": "Creating small apps (Python) for work automation",
    "Ph69": "Configuration and maintenance of the local network and network devices",
    "Ph70": "Access and authorization management",
    "Ph71": "Configuration of mobile devices",
    "Ph72": "Error and crash handling",
    "Ph73": "Computer hardware management and servicing",
    "Ph74": "Assembling and preparing workstations for work, including required software installation",
    "Ph75": "Installation of monitoring systems (IP cameras, recorders, online viewing)",
    "Ph76": "Creating website templates based on HTML, SCSS, JS",
    "Ph77": "January 2024",
    "Ph78": "Present",
    "Ph79": "A website showcasing my portfolio, including a career description, earned certificates, and completed projects. The site is responsive and intuitive, with sections detailing my skills, experience, and detailed information about projects, enhanced with links to the source code.",
    "Ph80": "The repository contains a browser-based game built with HTML, CSS, and JavaScript, utilizing libraries such as jQuery, Bootstrap, and Handlebars.js. Key features include a dynamic player control system that responds to key presses, manages animations, and handles physical interactions like gravity and friction. The game offers a variety of character actions such as running, jumping, crouching, guarding, and power-ups, making the gameplay interactive and dynamic. The UI update system displays the current health and power status of the player.",
    "Ph81": "I am a frontend developer with several years of experience in designing and developing modern web applications. My journey in IT began as an IT specialist, which gave me a solid technical foundation and a good understanding of the business context behind projects.",
    "Ph82": "I took my first steps in programming with Python, but JavaScript quickly became my main specialization. Since then, I have been consistently improving my skills, gaining experience in building efficient, scalable, and user-friendly applications.",
    "Ph83": "On a daily basis, I work on developing a B2B sales platform, where I am responsible for its performance, functionality, and usability. As part of various projects, I have had the opportunity to create a website for a photovoltaic manufacturer, develop configurators for modular houses, ballast structures, carports, and PV farms.",
    "Ph84": "In my work, I focus on high code quality, well-thought-out interfaces, and solutions that genuinely enhance user experience.",
    "Ph85": "Artificial intelligence plays an increasingly important role in my daily work – it supports me in design, debugging, and code optimization, as well as in automating repetitive tasks. This allows me to focus even more on key project aspects and delivering modern solutions.",
    "Ph86": "I am currently open to new challenges and collaboration opportunities. If you’d like to discuss a project or simply exchange experiences – feel free to get in touch!"
}
