{
    "Ph1": "PL",
    "Ph2": "Programista Frontend",
    "Ph3": "Doświadczenie",
    "Ph4": "Certyfikaty",
    "Ph5": "Projekty",
    "Ph6": "Od lat pasjonuję się IT, a po kilku latach pracy jako specjalista IT rozpocząłem karierę jako frontend developer, z mocnym postanowieniem dalszego rozwoju w tym obszarze. W przyszłości planuję również zgłębić backend development, aby lepiej zrozumieć cały proces tworzenia aplikacji oraz komunikację klient-serwer.",
    "Ph7": "Na co dzień zajmuję się programowaniem platformy B2B, rozwijaniem istniejących funkcji oraz wdrażaniem nowych rozwiązań. Pracuję nad ciekawymi projektami – między innymi stworzyłem stronę internetową dla producenta z branży fotowoltaicznej, konfigurator domów modułowych, a także frontendową część konfiguratora konstrukcji balastowych PV z kalkulatorem obciążenia wiatrem i śniegiem. Jestem gotów na kolejne wyzwania – im bardziej złożone, tym lepiej!",
    "Ph8": "Szczególnie zainteresowany jestem projektami w React, Vue i Angular.",
    "Ph9": "W przyszłości planuję również zagłębić się w pisanie części backendowej, aby kompleksowo zrozumieć cały proces tworzenia aplikacji i komunikacji na drodze klient-serwer.",
    "Ph10": "W trakcie mojej kariery jako developer zdarzyło mi się pisać nie tylko nowe elementy platformy sprzedażowej. Stworzyłem również konfigurator domów modułowych, konfigurator systemów balastowych oraz responsywną stronę internetową dla znanego dystrybutora technologii fotowoltaicznych.",
    "Ph11": "Rozwój Platformy B2B: Zaawansowane programowanie i optymalizacja platformy B2B (https://b2b.keno-energy.com) z naciskiem na wydajność i skalowalność",
    "Ph12": "Wdrażanie Zaawansowanych Funkcjonalności: Projektowanie i wdrażanie nowych, złożonych funkcjonalności na platformie sprzedażowej, zapewniając zgodność z istniejącą architekturą",
    "Ph13": "Tworzenie Zaawansowanych Komponentów UI: Tworzenie i wdrażanie nowoczesnych szablonów i komponentów stron internetowych, zgodnie z najlepszymi praktykami UX/UI i dostępności",
    "Ph14": "Zaawansowane Przetwarzanie Danych: Integracja i zarządzanie złożonymi operacjami na danych JSON, w tym parsowanie, walidacja i transformacja",
    "Ph15": "Zarządzanie Zasobami Graficznymi: Edycja i optymalizacja grafik 2D do celów webowych",
    "Ph16": "Mid Frontend Developer",
    "Ph17": "KENO Sp. z o.o.",
    "Ph18": "Junior Frontend Developer",
    "Ph19": "https://www.keno-energy.com/",
    "Ph20": "Styczeń 2023",
    "Ph21": "Grudzień 2023",
    "Ph22": "Programowanie platformy B2B (https://b2b.keno-energy.com)",
    "Ph23": "Wdrażanie nowych funkcjonalności do platformy sprzedażowej",
    "Ph24": "Tworzenie szablonów/komponentów stron internetowych",
    "Ph25": "Parsowanie danych/JSON",
    "Ph26": "Edycja grafik 2D do celów webowych",
    "Ph27": "HTML",
    "Ph28": "JavaScript",
    "Ph29": "CSS",
    "Ph30": "Bootstrap",
    "Ph31": "Handlebars",
    "Ph32": "Specjalista ds. IT Service Desk/Helpdesk",
    "Ph33": "Sierpień 2022",
    "Ph34": "Grudzień 2022",
    "Ph35": "Doradztwo IT",
    "Ph36": "Wsparcie pierwszej linii dla pracowników",
    "Ph37": "Obsługa błędów i awarii",
    "Ph38": "Składanie i przygotowanie stanowisk pracy, w tym instalacja wymaganych programów",
    "Ph39": "Zarządzanie i serwisowanie sprzętu komputerowego",
    "Ph40": "Obsługa zamówień sprzętu komputerowego",
    "Ph41": "Konfiguracja i utrzymanie urządzeń sieciowych, drukarek, terminali",
    "Ph42": "Analiza kosztów sprzętu",
    "Ph43": "Zarządzanie dostępami i uprawnieniami",
    "Ph44": "Zarządzanie licencjami oprogramowania",
    "Ph45": "Konfiguracja urządzeń mobilnych",
    "Ph46": "Wsparcie i pomoc dla działu IT",
    "Ph47": "VPN",
    "Ph48": "Sieć",
    "Ph49": "Sprzęt",
    "Ph50": "Administracja",
    "Ph51": "Helpdesk",
    "Ph52": "Starszy Specjalista IT",
    "Ph53": "iPrime Management sp. z o.o.",
    "Ph54": "Listopad 2021",
    "Ph55": "Lipiec 2022",
    "Ph56": "Administracja serwerami Linux (SMB, VPN, Docker, VPS (AWS), VMware, Zabbix)",
    "Ph57": "Bezpieczeństwo sprzętu i danych/szyfrowanie",
    "Ph58": "Administracja środowiskiem IT firmy",
    "Ph59": "Administracja domenami i subdomenami",
    "Ph60": "Odzyskiwanie danych",
    "Ph61": "Analiza kosztów utrzymania infrastruktury",
    "Ph62": "Tworzenie szablonów/komponentów używanych w aplikacjach React.js (JavaScript/TypeScript)",
    "Ph63": "Python",
    "Ph64": "Specjalista IT",
    "Ph65": "Wrzesień 2020",
    "Ph66": "Październik 2021",
    "Ph67": "Doradztwo IT",
    "Ph68": "Tworzenie małych aplikacji (Python) do automatyzacji pracy",
    "Ph69": "Konfiguracja i utrzymanie sieci lokalnej oraz urządzeń sieciowych",
    "Ph70": "Zarządzanie dostępami i uprawnieniami",
    "Ph71": "Konfiguracja urządzeń mobilnych",
    "Ph72": "Obsługa błędów i awarii",
    "Ph73": "Zarządzanie i serwisowanie sprzętu komputerowego",
    "Ph74": "Składanie i przygotowanie stanowisk pracy, w tym instalacja wymaganych programów",
    "Ph75": "Instalacja systemów monitoringu (kamery IP, rejestratory, podgląd online)",
    "Ph76": "Tworzenie szablonów stron internetowych na bazie HTML, SCSS, JS",
    "Ph77": "Styczeń 2024",
    "Ph78": "Obecnie",
    "Ph79": "Strona internetowa prezentująca moje portfolio, zawierająca opis kariery, zdobyte certyfikaty oraz zrealizowane projekty. Strona jest responsywna i intuicyjna, z sekcjami opisującymi moje umiejętności, doświadczenie oraz szczegółowe informacje o projektach, wzbogacone o linki do kodu źródłowego.",
    "Ph80": "Repozytorium zawiera testową grę przeglądarkową napisaną w HTML, CSS i JavaScript, z wykorzystaniem takich bibliotek jak jQuery, Bootstrap i Handlebars.js. Główne funkcjonalności obejmują dynamiczny system sterowania graczem, który reaguje na naciśnięcia klawiszy, zarządza animacjami oraz interakcjami fizycznymi, jak grawitacja i tarcie. Gra oferuje różnorodne akcje postaci, takie jak bieg, skok, kucanie, ochrona oraz wzmacnianie mocy, co sprawia, że rozgrywka jest interaktywna i dynamiczna. System aktualizacji interfejsu pokazuje bieżący stan życia i mocy gracza.",
    "Ph81": "Jestem frontend developerem z kilkuletnim doświadczeniem w projektowaniu i rozwijaniu nowoczesnych aplikacji webowych. Swoją drogę w IT rozpocząłem jako specjalista ds. IT, co dało mi solidne fundamenty techniczne oraz zrozumienie biznesowego kontekstu projektów.",
    "Ph82": "Pierwsze kroki w programowaniu stawiałem w Pythonie, jednak to JavaScript stał się moją główną specjalizacją. Od tego czasu konsekwentnie rozwijam swoje umiejętności, zdobywając doświadczenie w tworzeniu wydajnych, skalowalnych i przyjaznych użytkownikowi aplikacji.",
    "Ph83": "Na co dzień pracuję nad rozwojem platformy sprzedażowej B2B, gdzie odpowiadam za jej wydajność, funkcjonalność i intuicyjność. W ramach realizowanych projektów miałem okazję m.in. stworzyć stronę internetową dla producenta z sektora fotowoltaiki, opracować konfiguratory dla domów modułowych, konstrukcji balastowych, carportów oraz farm PV.",
    "Ph84": "W pracy stawiam na wysoką jakość kodu, przemyślane interfejsy i rozwiązania, które realnie poprawiają doświadczenia użytkowników.",
    "Ph85": "Coraz większą rolę w mojej codziennej pracy odgrywa sztuczna inteligencja – wspiera mnie w projektowaniu, debugowaniu i optymalizacji kodu, a także w automatyzacji powtarzalnych zadań. Dzięki temu mogę jeszcze mocniej skupić się na kluczowych aspektach projektu i dostarczaniu nowoczesnych rozwiązań.",
    "Ph86": "Obecnie jestem otwarty na nowe wyzwania i możliwości współpracy. Jeśli chcesz porozmawiać o projekcie lub po prostu wymienić doświadczenia – zapraszam do kontaktu!"
}
